Tekla Open API Reference for Tekla Structures 2025
Operation.DisplayPrompt Method
 Displays a message in the status bar.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool DisplayPrompt(
	string Message
)
Public Shared Function DisplayPrompt (
	Message As String
) As Boolean
Parameters
Message
Type: System.String
The message to display.
Return Value
Type: Boolean
True if the message could be displayed.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the Message is null.
Remarks
 Prompts
 Tekla Structures prefixes the given prompt with "prompt_" and looks for a translation in the prompts.ail file. If the translation (e.g. "prompt_Pick_first_position") is not found in the prompts.ail file, the prompt string is displayed as such. This feature can be used to give already translated strings to the picker.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace